package data.Lists;

public class QuestionsAnswers {

    private static String[] questions = new String[10];
    private static String[][] answers = new String[10][4];
    private static String[] correctAnswer = new String[10];

    QuestionsAnswers(){
        questions[0] = "Метод indexOf() возвращает...";
        answers[0][0] = "объект по индексу";
        answers[0][1] = "колличество индексов";
        answers[0][2] = "ничего не возвращает";
        answers[0][3] = "возвращает индекс";
        correctAnswer[0] = "возвращает индекс";

        questions[1] = "Метод set()...";
        answers[1][0] = "присваивает объект по индексу, возвращая прежднее значение";
        answers[1][1] = "присваевает объект по индексу, ничего не возвращая";
        answers[1][2] = "добавляет новый объект на посицию индекса, сдвигая прежде введенные элементы";
        answers[1][3] = "устанавливает операционную систему, которую ты ещё не создал";
        correctAnswer[1] = "присваивает объект по индексу, возвращая прежднее значение";

        questions[2] = "Метод add()...";
        answers[2][0] = "добавляет новый объект на посицию индекса";
        answers[2][1] = "добавляет пространство для новых объектов";
        answers[2][2] = "добавляет для тебя новое измерение, где ты становишься повелителем времени";
        answers[2][3] = "добавляет новый объект на посицию индекса, сдвигая прежде введенные элементы";
        correctAnswer[2] = "добавляет новый объект на посицию индекса, сдвигая прежде введенные элементы";

        questions[3] = "В чем отличие ArrayList от массива?";
        answers[3][0] = "Многие думают, что в них есть отличие, но на самом деле это ты все напридумывал";
        answers[3][1] = "Каждый добавленный объект связан с предыдущим и следующим";
        answers[3][2] = "Размер вместимости может увеличиваться магическим образом по мере необходимости";
        answers[3][3] = "Можно переопределить вычисление хэша";
        correctAnswer[3] = "Размер вместимости может увеличиваться магическим образом по мере необходимости";

        questions[4] = "Какую упорядоченность элементов создает List?";
        answers[4][0] = "По времени добавления";
        answers[4][1] = "По размеру хэша";
        answers[4][2] = "По чистой случайности";
        answers[4][3] = "Потому что!";
        correctAnswer[4] = "По времени добавления";

        questions[5] = "Разрешены ли в \"листах\" дублирующие элементы?";
        answers[5][0] = "Да";
        answers[5][1] = "Нет";
        answers[5][2] = "Кек";
        answers[5][3] = "Чебурек";
        correctAnswer[5] = "Да";

        questions[6] = "Чем примечателен LinkedList?";
        answers[6][0] = "Самый быстрый из \"листов\"";
        answers[6][1] = "Памяти немного жрет";
        answers[6][2] = "Элементы имеют двухсторонние связи";
        answers[6][3] = "Да кому он нужен?!";
        correctAnswer[6] = "Элементы имеют двухсторонние связи";

        questions[7] = "Метод shuffle() осуществляет...";
        answers[7][0] = "перемещение элементов из одного листа в другой";
        answers[7][1] = "перемешивание элементов листа";
        answers[7][2] = "переворачивание листа на бочок, чтобы пришёл голодный волчок";
        answers[7][3] = "перевыборы главного элемента в качестве стимуляции для остальных";
        correctAnswer[7] = "перемешивание элементов листа";

        questions[8] = "В каком случае пригодится LinkedList?";
        answers[8][0] = "При устройстве на работу обязательно про него спросят...";
        answers[8][1] = "Нужно быстро находить элементы листа";
        answers[8][2] = "При достижении лучшей производительности";
        answers[8][3] = "Необходимо много удалять/устанавливать новых объектов в середине листа";
        correctAnswer[8] = "Необходимо много удалять/устанавливать новых элементов в середине листа";

        questions[9] = "Как вы оцениваете данный опросник?";
        answers[9][0] = "Ужасно";
        answers[9][1] = "Нейтрально";
        answers[9][2] = "Хорошо";
        answers[9][3] = "Восхитительно!";
        correctAnswer[9] = "Восхитительно!";

    }

    static String getQuestion(int i){
        return questions[i];
    }

    static String[] getAnswers(int i){
        return answers[i];
    }

    static String getCorrectAnswer(int i){
        return correctAnswer[i];
    }
}
